# =============================================================================
# Brewfile - Essential development tools
# =============================================================================
# Install with: brew bundle --file=~/dotfiles/Brewfile

# Taps
tap "homebrew/bundle"
tap "oven-sh/bun"

# -----------------------------------------------------------------------------
# Core CLI Tools
# -----------------------------------------------------------------------------
brew "git"
brew "git-lfs"
brew "gh"                    # GitHub CLI

# Shell & Terminal
brew "zsh"
brew "fzf"                   # Fuzzy finder
brew "bat"                   # Better cat
brew "eza"                   # Better ls
brew "fd"                    # Better find
brew "ripgrep"               # Better grep
brew "zoxide"                # Smart cd
brew "thefuck"               # Command correction
brew "tree"                  # Directory tree

# -----------------------------------------------------------------------------
# Development
# -----------------------------------------------------------------------------
brew "fnm"                   # Fast Node Manager
brew "pnpm"                  # Fast npm alternative
brew "oven-sh/bun/bun"       # Bun runtime
brew "pyenv"                 # Python version manager
brew "pyenv-virtualenv"
brew "direnv"                # Directory environments

# -----------------------------------------------------------------------------
# Docker
# -----------------------------------------------------------------------------
brew "docker"
brew "docker-compose"
cask "docker"                # Docker Desktop

# -----------------------------------------------------------------------------
# Utilities
# -----------------------------------------------------------------------------
brew "jq"                    # JSON processor
brew "yq"                    # YAML processor
brew "curl"
brew "wget"
brew "htop"                  # Process viewer

# -----------------------------------------------------------------------------
# Applications (Casks)
# -----------------------------------------------------------------------------
cask "ghostty"
cask "raycast"
cask "visual-studio-code"
cask "arc"                   # Browser
